/********************   One Artisan's Regret And Pride   ***********************
*
*	@File    	： systick.c
*	@Brief   	： 
*	@Author  	： Blade@oarap.org
*	@Hardware	： STM32F103RCT6
*	@Date		： 2016-05
*	@Description： 
*	@History	： 
*
*	Rev1.0 
*		Date：2016-05-16
*		Author：Blade
*		Modification：
*
*--------------------Copyright (C) oarap.org 2016------------------------------
*----------------------All rights reserved-------------------------------------
*
********************          一名工匠的遗憾与骄傲          ********************/

#include "includes.h"


//u16 nTime;
//extern bool calculate_flag;
//=============================================================================
//函数名称: SYSTICK_Init
//功能概要:初始化SYSTICK，1us中断1次
//参数名称:无
//函数返回:无
//注意    :SystemCoreClock/ 1000000：1us中断1次；SystemCoreClock/ 1000：1ms中断
//        一次    100000:10us中断一次
//=============================================================================
void SYSTICK_Init(void)
{		
  while (SysTick_Config(SystemCoreClock/10000));
}
//=============================================================================
//函数名称: delay_us
//功能概要:每次定时1us
//参数名称:无
//函数返回:无
//注意   :无
//=============================================================================
void Delay_us(u16 nus)
{
  u8 i;	
  while(nus--)
  {
  	i=10;
	while(i--);
  }
}
//=============================================================================
//函数名称: delay_ms
//功能概要:每次定时1ms
//参数名称:无
//函数返回:无
//注意   :无
//=============================================================================
void Delay_ms( uint16_t time_ms )
{
  uint16_t i,j;
  for( i=0;i<time_ms;i++ )
  {
		for( j=0;j<10309;j++ );//大约1ms
  }
}
